src/turbulence_convergence_200_325/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 155.346;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 155.346;
    }
    sym
    {
        type            symmetry;
    }
    wedge
    {
        type            fixedValue;
        value           uniform 1e+06;
    }
    top
    {
        type            freestream;
        freestreamValue uniform 155.346;
        value           uniform 155.346;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 155.346;
        value           uniform 155.346;
    }
}


// ************************************************************************* //
